#include <iostream>
#include <vector>

/*Задача №66.Количество элементов, больших предыдущего
Числа следует выводить через пробел.Все числа целые, по модулю не больше 2^31 - 1. Количество элементов массива не превышает 10000.
Дан массив, состоящий из целых чисел.Напишите программу, которая подсчитает количество элементов массива, больших предыдущего(элемента с предыдущим номером).

Входные данные
Сначала задано число N
— количество элементов в массиве(1≤N≤10000
).Далее через пробел записаны N
чисел — элементы массива.Массив состоит из целых чисел.

Выходные данные
Необходимо вывести единственное число - количество элементов массива, больших предыдущего.

Примеры
Входные данные
5
1 2 3 4 5

Выходные данные
4
*/


void Task1()
{
    int n;
    std::cout << "Введите колличество элементов в массиве в диапазоне от 1 до 10000: ";
    std::cin >> n;
    
    if (n > 10000 || size < 1)
    {
        std::cout << "Ошибка! Колличество элементов выходят за диапазон";
    }

    std::vector<int> vec1;
  
    for (int i = 0; i < n; i++)
    {
		int reg;
        std::cout << "Введите " << i << " элемент массива: ";
        std::cin >> reg;
        vec1.push_back(reg);
    }

    std::cout << "Вывод: " << vec1.size() - 1;
}


/*
Задача №67.Есть ли два элемента с одинаковыми знаками
Числа следует выводить через пробел.Все числа целые, по модулю не больше 231 - 1. Количество элементов массива не превышает 10000.
Дан массив, состоящий из целых чисел.Напишите программу, которая определяет, есть ли в массиве пара соседних элементов с одинаковыми знаками.

Входные данные
Сначала задано число N — количество элементов в массиве(1≤N≤10000).Далее через пробел записаны N
чисел — элементы массива.Массив состоит из целых чисел не равных 0.

Выходные данные
Необходимо вывести слово YES, если существует пара соседних элементов с одинаковыми знаками.В противном случае следует вывести слово NO.

Примеры
Входные данные
5
1 - 3 4 - 2 1
Выходные данные
NO
*/


void Task2()
{
	int n1;
	//std::cout << "Введите размер размер массива в диапазоне от 1 до 10000 = ";
	std::cin >> n1;

	if (n1 > 10000 || n1 < 1)
	{
		std::cout << "Ошибка! Размер массива не соответствует условию!\n";
		return;
	}

	bool Flag = false;
	std::vector<int> vec2;
	for (int i = 0;i < n1;i++)
	{
		int reg1;
		std::cin >> reg1;
		if (reg1 == 0 || reg1%1!=0)
		{
			std::cout << "Ошибка! Введите целое число не равное 0\n";
		}

		vec2.push_back(reg1);

		if (i > 0)
		{
			if ((vec2[i] > 0 && vec2[i - 1] > 0) || (vec2[i] < 0 && vec2[i - 1] < 0))
			{
				Flag = true;
			}
		}
	}

	if (Flag)
	{
		std::cout << "YES\n";
	}
	else
	{
		std::cout << "NO\n";
	}
}


/*
Задача №68.Количество элементов больших обоих соседей
Числа следует выводить через пробел.Все числа целые, по модулю не больше 231 - 1. Количество элементов массива не превышает 10000.
Дан массив, состоящий из целых чисел.Напишите программу, которая в данном массиве определит количество элементов, у которых два соседних и, при этом, оба соседних элемента меньше данного.

Входные данные
Сначала задано число N
— количество элементов в массиве(1≤N≤100). Далее через пробел записаны N
чисел — элементы массива.Массив состоит из целых чисел.

Выходные данные
Необходимо вывести количество элементов массива, у которых два соседа и которые при этом строго больше обоих своих соседей.

Примеры
Входные данные
5
1 2 3 4 5

Выходные данные
0
Входные данные
5
1 5 1 5 1

Выходные данные
2
*/


void Task3()
{
	int n2;
	std::cin >> n2;

	if (n2 > 10000 || n2 < 1)
	{
		std::cout << "Ошибка! Размер массива не соответствует условию!\n";
		return;
	}

	int N = 0;
	std::vector<int> vec3;
	for (int i = 0;i < n2;i++)
	{
		double reg2;
		std::cin >> reg2;
		if (fmod(reg2, 1) != 0)
		{
			std::cout << "Ошибка! Введите целое число";
		}
		vec3.push_back(reg2);
	}

	for (int q = 1;q < n2 - 1;q++)
	{
		if ((vec3[q] > vec3[q - 1]) && (vec3[q] > vec3[q + 1]))
		{
			N++;
		}
	}

	std::cout << N << "\n";
}


/*
Задача №71. Циклический сдвиг вправо
Числа следует выводить через пробел. Все числа целые, по модулю не больше 231-1. Количество элементов массива не превышает 10000.
Напишите программу, которая циклически сдвигает элементы массива вправо (например, если элементы нумеруются, начиная с нуля,
то 0-й элемент становится 1-м, 1-й становится 2-м, ..., последний становится 0-м, то есть массив {3, 5, 7, 9} превращается в массив {9, 3, 5, 7}).

Входные данные
Сначала задано число N — количество элементов в массиве (1≤N≤35). Далее через пробел записаны Nчисел — элементы массива. Массив состоит из целых чисел.

Выходные данные
Необходимо вывести массив, полученный после сдвига элементов.

Примеры
Входные данные
6
4 5 3 4 2 3
Выходные данные
3 4 5 3 4 2
*/


void Task4()
{
	int n3;
	std::cin >> n3;
	if (n3 > 35 || n3 < 1)
	{
		std::cout << "Ошибка! Размер массива не соответствует условию!\n";
	}

	std::vector<int> vec4;

	for (int i = 0;i < n3;i++)
	{
		int reg3;
		std::cin >> reg3;
		vec4.push_back(reg3);
	}

		int t = vec4[n3 - 1];
		for (int q = n3 - 1;q > 0; --q)
		{
			vec4[q] = vec4[q - 1];
		}
		vec4[0] = t;

	for (int i = 0; i < n3; i++)
	{
		std::cout << vec4[i] << " ";
	}
	std::cout << std::endl;
}

/*
Задача №3167.Переставить min и max
В списке все элементы различны.Поменяйте местами минимальный и максимальный элемент этого списка.

Входные данные
Вводится список чисел.Все числа списка находятся на одной строке.

Выходные данные
Выведите ответ на задачу.

Примеры
Входные данные
3 4 5 2 1
Выходные данные
3 4 1 2 5
*/

void Task5()
{
	int n;
	std::cin >> n;
	std::vector<int> vec5;

	for (int i = 0; i < n; i++)
	{
		int reg;
		std::cin >> vec5[reg];
		vec5.push_back(reg);
	}

}

int main()
{
	setlocale(LC_ALL, "Russian");

	Task3();	

	return 0;
}
